1. change GraphViz to mermaid on markdown
