--- a/src/org/teachfx/antlr4/ep19/Design.md
+++ b/src/org/teachfx/antlr4/ep19/Design.md
@@ -2,20 +2,14 @@
 
 ## overview
 
-``` plantuml
-digraph G {
-    rankdir=TD
-    Input -> CharStream 
-    CharStream -> Tokens 
-    Tokens -> ParserTree
-    subgraph cluster_0 {
-        label = "语法树注释";
-        rankdir = LR
-         ParserTree -> AnnotatedParserTree1 [label="LocalDefine"]
-        AnnotatedParserTree1 -> AnnotatedParserTree2[label="LocalResolver"]
-        AnnotatedParserTree2 -> Interpreter
-    }
-}
+``` mermaid
+flowchart LR
+    Input --> CharStream 
+    CharStream --> Tokens 
+    Tokens --> ParserTree
+    ParserTree --Define--> AnnotatedParserTree
+    AnnotatedParserTree --Resolve--> AnnotatedParserTree 
+    AnnotatedParserTree --> Interpreter
 ```
 
 ``` plantuml
